OpenFOAM/ERCOFTAC-SIG15/case09.4/ahmed35/RANS/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    celling
    {
        type            slip;
    }

    floor
    {
        type            zeroGradient;
    }

    side
    {
        type            slip;
    }

    AhmedGroup
    {
        type            zeroGradient;
    }

    "proc.*"
    {
        type            processor;
    }

}

// ************************************************************************* //
